Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops/004.000.Notes.org
#+title: Chapter 4: Decisions & Loops
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%} .content ul:not(:first-child) {margin-top: 0.25em}}</style>

* Navigation
| Nav   | Title                                                       | Links                                   |
|-------+-------------------------------------------------------------+-----------------------------------------|
| Index | Notes Home                                                  | \vert [[file:../../../index.html][html]] \vert [[file:../../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | JavaScript & JQuery - Interactive Front-end Web Development | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development][github]] \vert |
| Prev  | Chapter 3: Functions, Methods & Objects                     | \vert [[file:../002.Basic_JavaScript_Instructions/002.000.Notes.html][html]] \vert [[file:../002.Basic_JavaScript_Instructions/002.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/002.Basic_JavaScript_Instructions][github]] \vert |
| Next  | Chapter 5: Document Object Model                            | \vert [[file:../005.Document_Object_Model/005.000.Notes.html][html]] \vert [[file:../005.Document_Object_Model/005.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model][github]] \vert |


* Notes
** Section 4.1: Decision Making
   - Code can take different paths depending on the condition set
   - Each path is made up of a different set of tasks which means you have to write different code for each situation
   - To set a condition you can use the comparison operators
   - Some examples of the comparison operators are: greater than (~>~), less than (~<~), double equal sign (~==~), and more
   - There are two components to a decision:
     1. An expression is evaluated which returns a value
     2. A conditional statement says what to do in a given situation
   - How does this work? The expression given is usually comparing two values using a comparison operator which returns a value of true or false
   - Now the conditional statements are the ~if/else~ statements, so if a condition is met then it executes a block of code, otherwise it will execute the other block of code
   - You can combine comparison operators to have multiple conditions inside a conditional statement

