Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops/004.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-30 Wed 17:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 4: Decisions &amp; Loops</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 4: Decisions &amp; Loops</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org11842f1">Navigation</a></li>
<li><a href="#org9930942">Notes</a>
<ul>
<li><a href="#org04840ab">Section 4.1: Decision Making</a></li>
<li><a href="#org6f1877b">Section 4.2: Comparison Operators - Evaluating Conditions</a></li>
<li><a href="#org415605a">Section 4.3: Logical Operators</a></li>
<li><a href="#org26f22ca">Section 4.4: Short-Circuit Evaluation</a></li>
<li><a href="#org72438be">Section 4.5: If-Statements &amp; If-Else Statements</a></li>
<li><a href="#org17c25e6">Section 4.6: Switch Statements</a></li>
<li><a href="#org9615a85">Section 4.7: Type Coercion &amp; Weak Typing</a></li>
<li><a href="#orgc74d831">Section 4.8: Loops</a></li>
</ul>
</li>
<li><a href="#org8424e8e">Keywords</a></li>
<li><a href="#org4dfd540">Questions</a></li>
<li><a href="#org3c2fe7e">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org11842f1" class="outline-2">
<h2 id="org11842f1">Navigation</h2>
<div class="outline-text-2" id="text-org11842f1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">JavaScript &amp; JQuery - Interactive Front-end Web Development</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 3: Functions, Methods &amp; Objects</td>
<td class="org-left">&vert; <a href="../002.Basic_JavaScript_Instructions/002.000.Notes.html">html</a> &vert; <a href="../002.Basic_JavaScript_Instructions/002.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/002.Basic_JavaScript_Instructions">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 5: Document Object Model</td>
<td class="org-left">&vert; <a href="../005.Document_Object_Model/005.000.Notes.html">html</a> &vert; <a href="../005.Document_Object_Model/005.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/005.Document_Object_Model">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org9930942" class="outline-2">
<h2 id="org9930942">Notes</h2>
<div class="outline-text-2" id="text-org9930942">
</div>
<div id="outline-container-org04840ab" class="outline-3">
<h3 id="org04840ab">Section 4.1: Decision Making</h3>
<div class="outline-text-3" id="text-org04840ab">
<ul class="org-ul">
<li>Code can take different paths depending on the condition set</li>
<li>Each path is made up of a different set of tasks which means you have to write different code for each situation</li>
<li>To set a condition you can use the comparison operators</li>
<li>Some examples of the comparison operators are: greater than (<code>&gt;</code>), less than (<code>&lt;</code>), double equal sign (<code>==</code>), and more</li>
<li>There are two components to a decision:
<ol class="org-ol">
<li>An expression is evaluated which returns a value</li>
<li>A conditional statement says what to do in a given situation</li>
</ol></li>
<li>How does this work? The expression given is usually comparing two values using a comparison operator which returns a value of true or false</li>
<li>Now the conditional statements are the <code>if/else</code> statements, so if a condition is met then it executes a block of code, otherwise it will execute the other block of code</li>
<li>You can combine comparison operators to have multiple conditions inside a conditional statement</li>
</ul>
</div>
</div>
