Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops/004.000.Notes.org
** Section 4.2: Comparison Operators - Evaluating Conditions
   - Evaluations using comparison operators will always result in a true or false
   - Here are the following comparison operators:
   | Operator                        | Definition                                                                                         | Example                       |
   |---------------------------------+----------------------------------------------------------------------------------------------------+-------------------------------|
   | ~==~ (Is Equal To)              | This operator compares two values (numbers, strings, or booleans) to see if they are the same      | ~"Hello" == "Bye"~ => false   |
   |                                 |                                                                                                    | ~"Hello" == "Hello"~ => true  |
   |                                 |                                                                                                    | ~"3" == 3~ => true            |
   | ~===~ (Strict Equal To)         | This operator compares two values to check that both the data type and value are the same          | ~"3" === 3~ => false          |
   |                                 |                                                                                                    | ~"3" === "3"~ => true         |
   | ~!=~ (Is Not Equal To)          | This operator compares two values (numbers, strings, or booleans) to see if they are not the same  | ~"Hello" != "Bye"~ => true    |
   |                                 |                                                                                                    | ~"Hello" != "Hello"~ => false |
   |                                 |                                                                                                    | ~"3" != 3~ => false           |
   | ~!==~ (Strict Not Equal To)     | This operator compares two values to check that both the data type and value are not the same      | ~"3" !== 3~ => true           |
   |                                 |                                                                                                    | ~"3" !== "3"~ => false        |
   | ~>~ (Greater Than)              | This operator checks if the number on the left is greater than the number on the right             | ~4 > 3~ => true               |
   |                                 |                                                                                                    | ~3 > 4~ => false              |
   | ~>=~ (Greater Than or Equal To) | This operator checks if the number on the left is greater than or equal to the number on the right | ~4 >= 4~ => true              |
   |                                 |                                                                                                    | ~3 >= 4~ => false             |
   |                                 |                                                                                                    | ~3 >= "3"~ => true            |
   | ~<~ (Less Than)                 | This operator checks if the number on the left is less than the number on the right                | ~4 < 3~ => false              |
   |                                 |                                                                                                    | ~3 < 4~ => true               |
   | ~<=~ (Less Than or Equal To)    | This operator checks if the number on the left is less than or equal to the number on the right    | ~4 <= 3~ => false             |
   |                                 |                                                                                                    | ~3 <= 4~ => true              |
   |                                 |                                                                                                    | ~3 <= 3~ => true              |

   - These comparison operators require two operands and each operand is placed on each side of the operator
   - The operands can be values, variables, or other expressions that evaluate to a single value
   - Recall using a comparison operator with operands is an expression itself because it resolves into a single value: true or false
   - Thus, you can have a conditional expression that is made up of mathematical expressions, string expressions, or even other conditional expressions
   - How can conditional expressions be operands to another conditional expression?
   - Well think of ~true~ as a 1 and ~false~ as a 0, thus if you were to evaluate the condition ~true > false~ then this will evaluate to true because true is made to be a 1 and false is made to be a 0, so it is true that one is greater than 0
   - Example of conditional expression as operands to a conditional expression: ~(3 >= "3") > (3 <= 4)~ => this evaulates to ~true > true~ which in turn evaluates to false because 1 is not greater than 1
   - Example of mathematical expression as operands to a conditional expression: ~(3 + 5) > (1 + 2)~ => this evaulates to ~8 > 3~ which is true
   - These comparison expressions can be joined and combined with other comparison or boolean expressions by using the logical operators

** Section 4.3: Logical Operators
   - Comparison operators usually return single values of ~true~ or ~false~
   - Logical operators allow you to compare the results of more than one comparison operator
   - Here are the logical operators
   | Operator                | # of Operands | Defintion                                                                                      | Example                                                                                                            |
   |-------------------------+---------------+------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------|
   | ~&&~ (Logical And)      |             2 | This operator evaluate to true, only if *BOTH* operands evaluate to true, otherwise false      | ~(2 < 5) && (3 > 4)~ => false because the right operand evaluates to false                                         |
   | \vert\vert (Logical OR) |             2 | This operator evaluate to true, only if at least one operand evaluate to true, otherwise false | (2 < 5) \vert\vert (3 > 4) => true because the left operand is true                                                |
   | ~!~ (Logical Not)       |             1 | This operator takes a single boolean value and inverts it                                      | ~!(2 < 1)~ => true because ~(2 < 1)~ evaluates to false but then the logical not inverts the value and we get true |
   - The logical AND and logical OR both take two operands, these are binary operators while the logical NOT is a uniary operator and only needs one operand
   -

