Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops/004.000.Notes.html

<div id="outline-container-org6f1877b" class="outline-3">
<h3 id="org6f1877b">Section 4.2: Comparison Operators - Evaluating Conditions</h3>
<div class="outline-text-3" id="text-org6f1877b">
<ul class="org-ul">
<li>Evaluations using comparison operators will always result in a true or false</li>
<li>Here are the following comparison operators:</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Definition</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>==</code> (Is Equal To)</td>
<td class="org-left">This operator compares two values (numbers, strings, or booleans) to see if they are the same</td>
<td class="org-left"><code>"Hello" == "Bye"</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>"Hello" == "Hello"</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>"3" == 3</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left"><code>===</code> (Strict Equal To)</td>
<td class="org-left">This operator compares two values to check that both the data type and value are the same</td>
<td class="org-left"><code>"3" === 3</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>"3" === "3"</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left"><code>!=</code> (Is Not Equal To)</td>
<td class="org-left">This operator compares two values (numbers, strings, or booleans) to see if they are not the same</td>
<td class="org-left"><code>"Hello" != "Bye"</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>"Hello" != "Hello"</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>"3" != 3</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left"><code>!==</code> (Strict Not Equal To)</td>
<td class="org-left">This operator compares two values to check that both the data type and value are not the same</td>
<td class="org-left"><code>"3" !== 3</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>"3" !== "3"</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left"><code>&gt;</code> (Greater Than)</td>
<td class="org-left">This operator checks if the number on the left is greater than the number on the right</td>
<td class="org-left"><code>4 &gt; 3</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>3 &gt; 4</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left"><code>&gt;=</code> (Greater Than or Equal To)</td>
<td class="org-left">This operator checks if the number on the left is greater than or equal to the number on the right</td>
<td class="org-left"><code>4 &gt;= 4</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>3 &gt;= 4</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>3 &gt;= "3"</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left"><code>&lt;</code> (Less Than)</td>
<td class="org-left">This operator checks if the number on the left is less than the number on the right</td>
<td class="org-left"><code>4 &lt; 3</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>3 &lt; 4</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left"><code>&lt;=</code> (Less Than or Equal To)</td>
<td class="org-left">This operator checks if the number on the left is less than or equal to the number on the right</td>
<td class="org-left"><code>4 &lt;= 3</code> =&gt; false</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>3 &lt;= 4</code> =&gt; true</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>3 &lt;= 3</code> =&gt; true</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>These comparison operators require two operands and each operand is placed on each side of the operator</li>
<li>The operands can be values, variables, or other expressions that evaluate to a single value</li>
<li>Recall using a comparison operator with operands is an expression itself because it resolves into a single value: true or false</li>
<li>Thus, you can have a conditional expression that is made up of mathematical expressions, string expressions, or even other conditional expressions</li>
<li>How can conditional expressions be operands to another conditional expression?</li>
<li>Well think of <code>true</code> as a 1 and <code>false</code> as a 0, thus if you were to evaluate the condition <code>true &gt; false</code> then this will evaluate to true because true is made to be a 1 and false is made to be a 0, so it is true that one is greater than 0</li>
<li>Example of conditional expression as operands to a conditional expression: <code>(3 &gt;= "3") &gt; (3 &lt;= 4)</code> =&gt; this evaulates to <code>true &gt; true</code> which in turn evaluates to false because 1 is not greater than 1</li>
<li>Example of mathematical expression as operands to a conditional expression: <code>(3 + 5) &gt; (1 + 2)</code> =&gt; this evaulates to <code>8 &gt; 3</code> which is true</li>
<li>These comparison expressions can be joined and combined with other comparison or boolean expressions by using the logical operators</li>
</ul>
</div>
</div>

<div id="outline-container-org415605a" class="outline-3">
<h3 id="org415605a">Section 4.3: Logical Operators</h3>
<div class="outline-text-3" id="text-org415605a">
<ul class="org-ul">
<li>Comparison operators usually return single values of <code>true</code> or <code>false</code></li>
<li>Logical operators allow you to compare the results of more than one comparison operator</li>
<li>Here are the logical operators</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-right"># of Operands</th>
<th scope="col" class="org-left">Defintion</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&amp;&amp;</code> (Logical And)</td>
<td class="org-right">2</td>
<td class="org-left">This operator evaluate to true, only if <b>BOTH</b> operands evaluate to true, otherwise false</td>
<td class="org-left"><code>(2 &lt; 5) &amp;&amp; (3 &gt; 4)</code> =&gt; false because the right operand evaluates to false</td>
</tr>

<tr>
<td class="org-left">&vert;&vert; (Logical OR)</td>
<td class="org-right">2</td>
<td class="org-left">This operator evaluate to true, only if at least one operand evaluate to true, otherwise false</td>
<td class="org-left">(2 &lt; 5) &vert;&vert; (3 &gt; 4) =&gt; true because the left operand is true</td>
</tr>

<tr>
<td class="org-left"><code>!</code> (Logical Not)</td>
<td class="org-right">1</td>
<td class="org-left">This operator takes a single boolean value and inverts it</td>
<td class="org-left"><code>!(2 &lt; 1)</code> =&gt; true because <code>(2 &lt; 1)</code> evaluates to false but then the logical not inverts the value and we get true</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>The logical AND and logical OR both take two operands, these are binary operators while the logical NOT is a uniary operator and only needs one operand</li>
<li></li>
</ul>
</div>
</div>
