Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops/004.000.Notes.html

<div id="outline-container-org26f22ca" class="outline-3">
<h3 id="org26f22ca">Section 4.4: Short-Circuit Evaluation</h3>
<div class="outline-text-3" id="text-org26f22ca">
<ul class="org-ul">
<li>Logical expressions are evaluated left to right</li>
<li>If the first condition can provide enough information to get the answer, then there is no need to evaluate the second condition</li>
<li>For example, for logical AND we need both operands to evaluate to true for the expression to be true otherwise it is false, so if we have <code>false &amp;&amp; anything</code> this automatically tells us this will evaluate to false because once one operand is false it is not possible to have both operands to be true</li>
<li>For logical OR there must be at least one operand to evaluate to true for the expression to be true otherwise it is false, so if we have <code>true || anything</code> then there is no need to check the second condition because this will automatically be true because it met the requirement for at least one operand to be true</li>
<li>One thing to note about short-circuit evaulation is that it will return the value that stopped the processing even if the value is not a real boolean value such as true or false</li>
<li>The value may be a number or string depending on how JS treats it (either true or false)</li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">var artist1 = "Artist";
var artist2 = (artist1 || "Unknown")
</pre>
</div>

<ul class="org-ul">
<li>In the example above, <code>artist1</code> is a string with a value so JS will treat it as true and no longer needs to check the other condition, thus it returns the value that stopped the processing (<code>artist1</code>)</li>
<li>Thus short-circuit evaluation will return "Artist" the string obtained from the variable <code>artist1</code> and not a boolean value because the variable was not a boolean but a string</li>
<li>Programmers use this creatively to set values for variables or even create objects</li>
<li>Programmers often put the code most likely to return true first in OR operations and false answers first in AND operations</li>
<li>Place the options requiring the most processing power last, just in case short-circuit evaluation determines an answer before</li>
</ul>
</div>
</div>

<div id="outline-container-org72438be" class="outline-3">
<h3 id="org72438be">Section 4.5: If-Statements &amp; If-Else Statements</h3>
<div class="outline-text-3" id="text-org72438be">
<ul class="org-ul">
<li>The <code>if</code> statement evaluates (or checks) a condition and if the condition evaluates to true then any statements in the subsequent code block are executed</li>
<li>If the condition evaluates to false then the subsequent code block is not executed and is skipped and continues to run whatever is after the <code>if</code> statement</li>
<li>Example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">if (score &gt;= 50) {
  congratulate();
}
</pre>
</div>

<ul class="org-ul">
<li>The <code>if-else</code> statements is similar to the <code>if</code> statements, a condition is evaluated and if it resolves to true then the first code block is executed inside the <code>if</code></li>
<li>If the condition resolves to false then the second code block is run instead inside the <code>else</code> statement</li>
<li>Example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">if (scopre &gt;= 50) {
  congratulate();
}

else {
  encourage();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org17c25e6" class="outline-3">
<h3 id="org17c25e6">Section 4.6: Switch Statements</h3>
<div class="outline-text-3" id="text-org17c25e6">
<ul class="org-ul">
<li>A switch statement starts with a variable called the switch value</li>
<li>Each case indicates a possible value for this variable (switch value) and the code that should if the variable matches that value</li>
<li>Example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">switch (level) {
  case "One":
    title = "Level 1";
    break;
  case "Two":
    title = "Level 2";
    break;
  case "Three":
    title = "Level 3";
    break;
  default:
    title = "Test";
    break;
}
</pre>
</div>

<ul class="org-ul">
<li>In the example above, the variable named <code>level</code> is the switch value (the switch value can also be an expression, not just a variable)</li>
<li>If the value of the <code>level</code> variable matches with string "One", "Two", or "Three" it will execute the corresponding code below the case</li>
<li>If none of these match the variable then the code after the default will be executed</li>
<li>The <code>break</code> keyword tells the interpreter that it has finished with the <code>switch</code> statement, thus without it will continue to execute code until it finds a break keyword or the switch statement ends</li>
<li>This is why after each case statement we add a <code>break</code> so that option will not begin executing code from a different case option</li>
<li>Although similar to <code>if-else</code> statements and ultimately can achieve the same results as <code>if-else</code> statements, the switch statement has its use cases and is more suitable for certain situations than if-else statements (please see the questions section in this notes)</li>
</ul>
</div>
</div>

<div id="outline-container-org9615a85" class="outline-3">
<h3 id="org9615a85">Section 4.7: Type Coercion &amp; Weak Typing</h3>
<div class="outline-text-3" id="text-org9615a85">
<ul class="org-ul">
<li>If you use a data type JavaScript did not expect then it tries to make sense of the operation rather than report an error</li>
<li>JS can convert data types behind the scenes to complete an operation, this is known as type coercion</li>
<li>For example, the string '1' can be converted to a number 1 in the following expression: <code>('1' &gt; 0)</code></li>
<li>Type coercion can lead to unexpected values, bugs, or errors in your code and is often recommended to use strict equals operators such as <code>===</code> or <code>!==</code> than <code>==</code> and <code>!=</code> as strict operators check that the value and data types match</li>
<li>Due to type coercion, every value in JS can be treated as if it were true or false</li>
<li>Falsy values are treated as if they are false and this includes the boolean value false, the number 0, empty string, NaN (not a number), and a variable with no value assigned to it</li>
<li>Truthy values are treated as if they are true and this includes almost everything else besides the falsy values which are the boolean value true, numbers other than zero, strings with content, number calculations, objects, arrays, etc.</li>
<li>Objects and arrays are evaulated to true and can be useful when checking if an object exists and it is not pointing to null</li>
<li>Because the presence of an object or array can be considered truthy it is often used to check for the existence of an element within a page</li>
<li>When comparing falsy values and not using the strict equality operators then the boolean value false, zero, and an empty string are equivalent but when using the strict equality operators they are not equivalent</li>
<li>Null and undefined are both falsy and are equivalent only to themselves when not using the strict equality operators but when using the strict equality operators they are not equivalent</li>
<li>NaN is not equivalent to anything even if you do not use the strict equality operators, not even to itself</li>
<li>JS has weak typing because the data type for a variable can change unlike strong typing languages in which they require you to specify what data type each variable will be</li>
</ul>
</div>
</div>

<div id="outline-container-orgc74d831" class="outline-3">
<h3 id="orgc74d831">Section 4.8: Loops</h3>
<div class="outline-text-3" id="text-orgc74d831">
<ul class="org-ul">
<li>Loops check a condition, and if it returns true then a code block will run, then the condition will be checked again and if it still returns true the code block will run again, it repeats until the condition returns false</li>
<li>There are 3 common types of loops:
<ul class="org-ul">
<li>For Loops:</li>
<li>While Loops:</li>
<li>Do-While Loops:</li>
</ul></li>
</ul>
</div>
</div>
</div>
