Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops/004.000.Notes.org
* Questions
  - *Q*: What is the difference between the comparison operators ~==~ and ~===~?
  - *Q*: Is there a strict greater than or equal to operator?
  - *Q*: When to use ~switch~ statements compared to ~if-else~ statements?
* Summary
