Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/004.Decisions_and_Loops/004.000.Notes.html

<div id="outline-container-org8424e8e" class="outline-2">
<h2 id="org8424e8e">Keywords</h2>
<div class="outline-text-2" id="text-org8424e8e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4dfd540" class="outline-2">
<h2 id="org4dfd540">Questions</h2>
<div class="outline-text-2" id="text-org4dfd540">
<ul class="org-ul">
<li><b>Q</b>: What is the difference between the comparison operators <code>==</code> and <code>===</code>?</li>
<li><b>Q</b>: Is there a strict greater than or equal to operator?</li>
<li><b>Q</b>: When to use <code>switch</code> statements compared to <code>if-else</code> statements?</li>
</ul>
</div>
</div>
<div id="outline-container-org3c2fe7e" class="outline-2">
<h2 id="org3c2fe7e">Summary</h2>
</div>
</div>
</body>
</html>
